app/Models/UsuarioModel.php

SELECT *
FROM `tbl_roles`
WHERE `idRol` = '2'
---
    public function agregarUnRol(string $rol){
        $row = $this->db()->table('tbl_roles')->where('rol',$rol)->get()->getFirstRow();
        if($row !== null){
            $this->asignarRol = $row->idRol;
        }
    }

    /*public function agregarUnDosRol(string $rol){
        $row = $this->db()->table('tbl_roles')->where('rol',$rol)->get()->getFirstRow();